# Project 3 - Part 1 - Business Problem
- Steven Phillips
- December 16, 2022

## Loading the Data Sets

Dataset urls

https://datasets.imdbws.com/title.basics.tsv.gz

https://datasets.imdbws.com/title.ratings.tsv.gz

https://datasets.imdbws.com/title.akas.tsv.gz

In [54]:
# initial run download from url no longer needed

# basics_url="https://datasets.imdbws.com/title.basics.tsv.gz"
# ratings_url="https://datasets.imdbws.com/title.ratings.tsv.gz"
# akas_url="https://datasets.imdbws.com/title.akas.tsv.gz"

In [2]:
import pandas as pd

In [55]:
# initial run download from url
# basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [56]:
# Open saved file
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [57]:
# initial run download from url
# ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

In [59]:
# Open saved file
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [58]:
# initial run download from url
# akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [60]:
# Open saved file
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

## Preprocessing the Data

### Copying the dataframes

In [6]:
df_basics = basics.copy()
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [7]:
df_ratings = ratings.copy()
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [8]:
df_akas = akas.copy()
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

### Replace /N with np.nan

In [9]:
import numpy as np

In [10]:
df_basics_backup = df_basics.copy()
df_basics = df_basics.replace({'\\N':np.nan})
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [11]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9448506 entries, 0 to 9448505
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 648.8+ MB

In [12]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1257370 entries, 0 to 1257369
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1257370 non-null  object
 1   averageRating  1257370 non-null  float64
 2   numVotes       1257370 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.8+ MB

In [13]:
df_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34190214 entries, 0 to 34190213
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.0+ GB

### Eliminate basic movie titles that are null for runtimeMinutes and genre

In [14]:
df_basics.isna().sum()

tconst                  0
titleType               0
primaryTitle           11
originalTitle          11
isAdult                 1
startYear         1265710
endYear           9348665
runtimeMinutes    6755882
genres             431729
dtype: int64

In [15]:
df_basics.dropna(subset=['runtimeMinutes'], inplace=True)

In [16]:
df_basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear          115493
endYear           2644041
runtimeMinutes          0
genres              74310
dtype: int64

In [17]:
df_basics.dropna(subset=['genres'], inplace=True)

In [18]:
df_basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear          110572
endYear           2571306
runtimeMinutes          0
genres                  0
dtype: int64

### Keep only from basics 'movie' titleTypes

In [19]:
df_basics['titleType'].value_counts()

tvEpisode       1260290
short            585571
movie            373694
video            177548
tvMovie           89350
tvSeries          88259
tvSpecial         17214
tvMiniSeries      16574
tvShort            9501
videoGame           313
Name: titleType, dtype: int64

In [20]:
titleType_filter = df_basics['titleType']=='movie'

In [21]:
df_basics = df_basics.loc[titleType_filter, :]

In [22]:
df_basics['titleType'].value_counts()

movie    373694
Name: titleType, dtype: int64

### Keep 'startYear' movies 2000-2022

In [23]:
df_basics['startYear'].isna().sum()

5992

In [24]:
df_basics['startYear'].fillna(0, inplace=True)

In [25]:
df_basics['startYear'] = df_basics['startYear'].astype('int64')

In [26]:
startYear_filter_1 = df_basics['startYear'] > 1999

In [27]:
startYear_filter_2 = df_basics['startYear'] < 2023

In [28]:
df_basics = df_basics.loc[startYear_filter_1 & startYear_filter_2, :]

In [29]:
df_basics['startYear'].value_counts()

2017    14254
2018    14202
2019    13891
2016    13870
2015    13388
2014    13019
2013    12324
2021    12027
2012    11574
2022    11514
2020    11386
2011    10725
2010    10149
2009     9311
2008     8107
2007     6916
2006     6460
2005     5785
2004     5159
2003     4548
2002     4105
2001     3824
2000     3611
Name: startYear, dtype: int64

### Eliminate movies that include 'documentary' in genre

In [30]:
# Exclude movies that are included in the documentary category.
is_documentary = df_basics['genres'].str.contains('documentary',case=False)
df_basics = df_basics[~is_documentary]

### Keep only 'US' movies in AKAs and Basics

In [31]:
US_filter = df_akas['region']=='US'

In [32]:
df_akas = df_akas.loc[US_filter, :]

In [33]:
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
14,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
36,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
41,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [34]:
# Filter the basics table down to only include the US by using the filtered akas dataframe
keepers = df_basics['tconst'].isin(akas['titleId'])
keepers

34804      True
61117      True
67670      True
77965      True
86802      True
           ...
9448178    True
9448187    True
9448226    True
9448271    True
9448355    True
Name: tconst, Length: 145646, dtype: bool

In [35]:
keepers.info()

<class 'pandas.core.series.Series'>
Int64Index: 145646 entries, 34804 to 9448355
Series name: tconst
Non-Null Count   Dtype
--------------   -----
145646 non-null  bool
dtypes: bool(1)
memory usage: 1.3 MB

In [36]:
df_basics = df_basics[keepers]
df_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34804,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61117,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67670,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77965,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86802,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
9448178,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
9448187,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
9448226,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
9448271,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9448355,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

### Replace /N in akas

In [37]:
df_akas_backup = df_akas.copy()
df_akas = df_akas.replace({'\\N':np.nan})
df_akas.head(5)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

### Replace /N in ratings and keep only 'US' movies in ratings

In [38]:
df_ratings_backup = df_ratings.copy()
df_ratings = df_ratings.replace({'\\N':np.nan})
df_ratings.head(5)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [39]:
# Filter the ratings table down to only include the US by using the filtered akas dataframe
keepers_ratings = df_ratings['tconst'].isin(akas['titleId'])
keepers_ratings

0           True
1           True
2           True
3           True
4           True
           ...
1257365    False
1257366     True
1257367     True
1257368     True
1257369    False
Name: tconst, Length: 1257370, dtype: bool

In [40]:
df_ratings = df_ratings[keepers_ratings]
df_ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1926
1        tt0000002            5.8       261
2        tt0000003            6.5      1743
3        tt0000004            5.6       176
4        tt0000005            6.2      2555
...            ...            ...       ...
1257358  tt9916538            8.3         6
1257359  tt9916544            6.9        61
1257366  tt9916720            5.4       285
1257367  tt9916730            8.0         8
1257368  tt9916766            6.7        21

[940512 rows x 3 columns]

## Save data frames to 'Data' folder as compressed files

In [41]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 144992 entries, 34804 to 9448355
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          144992 non-null  object
 1   titleType       144992 non-null  object
 2   primaryTitle    144992 non-null  object
 3   originalTitle   144992 non-null  object
 4   isAdult         144992 non-null  object
 5   startYear       144992 non-null  int64
 6   endYear         0 non-null       object
 7   runtimeMinutes  144992 non-null  object
 8   genres          144992 non-null  object
dtypes: int64(1), object(8)
memory usage: 11.1+ MB

In [42]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 940512 entries, 0 to 1257368
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         940512 non-null  object
 1   averageRating  940512 non-null  float64
 2   numVotes       940512 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ MB

In [43]:
df_akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1392551 entries, 5 to 34189958
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1392551 non-null  object
 1   ordering         1392551 non-null  int64
 2   title            1392551 non-null  object
 3   region           1392551 non-null  object
 4   language         3739 non-null     object
 5   types            967472 non-null   object
 6   attributes       45514 non-null    object
 7   isOriginalTitle  1391206 non-null  object
dtypes: int64(1), object(7)
memory usage: 95.6+ MB

In [44]:
# make new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

['title_akas.csv.gz', 'title_basics.csv.gz', 'title_ratings.csv.gz']

In [45]:
## Save current basics dataframe to file.
df_basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [46]:
## Save current ratings dataframe to file.
df_ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [47]:
## Save current basics dataframe to file.
df_akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [48]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [52]:
# Open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [53]:
# Open saved file and preview again
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0